Revit 2027 API
BorderTile Enumeration
Options for controlling tiles that overlap the face boundary. See DividedSurface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BorderTile
Public Enumeration BorderTile
public enum class BorderTile
type BorderTile
Members
Member name | Value | Description
Empty | 0
Overhanging | 2
Partial | 1
See Also
Reference
Autodesk.Revit.DB Namespace